<a href="https://colab.research.google.com/github/shubhkhanna/Colab-Notebooks-IB241/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [26]:
import pandas as pd
import numpy as np

In [27]:
df = pd.read_csv("https://raw.githubusercontent.com/shubhkhanna/Colab-Notebooks-IB241/master/DataSet/Ufo.csv")
df

       Unnamed: 0                  City  ... State              Time
0               0                Ithaca  ...    NY    6/1/1930 22:00
1               1           Willingboro  ...    NJ   6/30/1930 20:00
2               2               Holyoke  ...    CO   2/15/1931 14:00
3               3               Abilene  ...    KS    6/1/1931 13:00
4               4  New York Worlds Fair  ...    NY   4/18/1933 19:00
...           ...                   ...  ...   ...               ...
18236       18236            Grant Park  ...    IL  12/31/2000 23:00
18237       18237           Spirit Lake  ...    IA  12/31/2000 23:00
18238       18238           Eagle River  ...    WI  12/31/2000 23:45
18239       18239           Eagle River  ...    WI  12/31/2000 23:45
18240       18240                  Ybor  ...    FL  12/31/2000 23:59

[18241 rows x 6 columns]

In [28]:
df.loc[0:5,"City"]

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
5             Valley City
Name: City, dtype: object

In [29]:
df.iloc[[0,1,2,3],[2,4]]

  Colors Reported State
0             Red    NY
1             Red    NJ
2             Red    CO
3             Red    KS

In [30]:
df.iloc[[1,3,5,7,9],:]

   Unnamed: 0         City  ... State             Time
1           1  Willingboro  ...    NJ  6/30/1930 20:00
3           3      Abilene  ...    KS   6/1/1931 13:00
5           5  Valley City  ...    ND  9/15/1934 15:30
7           7         Alma  ...    MI   7/15/1936 0:00
9           9      Hubbard  ...    OR   6/15/1937 0:00

[5 rows x 6 columns]

In [31]:
df.loc[[0,1,2],["State","Time"]]

  State             Time
0    NY   6/1/1930 22:00
1    NJ  6/30/1930 20:00
2    CO  2/15/1931 14:00

In [36]:
df=df.iloc[:,1:]
df

      Colors Reported Shape Reported State              Time
0                 Red       TRIANGLE    NY    6/1/1930 22:00
1                 Red          OTHER    NJ   6/30/1930 20:00
2                 Red           OVAL    CO   2/15/1931 14:00
3                 Red           DISK    KS    6/1/1931 13:00
4                 Red          LIGHT    NY   4/18/1933 19:00
...               ...            ...   ...               ...
18236             Red       TRIANGLE    IL  12/31/2000 23:00
18237             Red           DISK    IA  12/31/2000 23:00
18238             Red          LIGHT    WI  12/31/2000 23:45
18239             RED          LIGHT    WI  12/31/2000 23:45
18240             Red           OVAL    FL  12/31/2000 23:59

[18241 rows x 4 columns]

In [39]:
df.iloc[:,[0,2,3,]]

      Colors Reported State              Time
0                 Red    NY    6/1/1930 22:00
1                 Red    NJ   6/30/1930 20:00
2                 Red    CO   2/15/1931 14:00
3                 Red    KS    6/1/1931 13:00
4                 Red    NY   4/18/1933 19:00
...               ...   ...               ...
18236             Red    IL  12/31/2000 23:00
18237             Red    IA  12/31/2000 23:00
18238             Red    WI  12/31/2000 23:45
18239             RED    WI  12/31/2000 23:45
18240             Red    FL  12/31/2000 23:59

[18241 rows x 3 columns]